app/Controllers/Mascotas.php

    public function index()
    {
        $mascotasModel = new MascotasModel();
        $data['mascotas'] = $mascotasModel->orderBy('ID_MASCOTA', 'DESC')->findAll();
---
SELECT *
FROM `VE_MASCOTAS`
ORDER BY `ID_MASCOTA` DESC